Учет_ФК/src/Documents/ПаспортКачестваНаПартиюПродукции/ПаспортКачестваНаПартиюПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПаспортКачестваНаПартиюПродукции</name>
  <registerRecords>InformationRegister.ДанныеПаспортовКачества</registerRecords>
  <attributes>
    <name>ДокументИсследования</name>
    <type>
      <types>DocumentRef.ПроведениеЛабораторныхИсследований</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Грузоперевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДоговорГрузоперевозчика</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартияПродукции</name>
    <type>
      <types>CatalogRef.ПартииПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизаНачальнОТК</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВизаЗаведующийЛабораторией</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Учет_ФК/src/Documents/ПаспортКачестваНаПартиюПродукции/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.ВерсионированиеОбъектов
ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры


&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = Справочники.Контрагенты.ПолучитьОсновнойДоговорКонтрагента(Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГрузоперевозчикПриИзмененииНаСервере()
	Объект.ДоговорГрузоперевозчика = Справочники.Контрагенты.ПолучитьОсновнойДоговорКонтрагента(Объект.Грузоперевозчик);
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозчикПриИзменении(Элемент)
	ГрузоперевозчикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПартияПродукцииПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ПартияПродукции) Тогда 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВыпускПродукции.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВыпускПродукции КАК ВыпускПродукции
			|ГДЕ
			|	ВыпускПродукции.Партия = &Партия";
		
		Запрос.УстановитьПараметр("Партия", Объект.ПартияПродукции);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда 
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
				Объект.ДокументВыпуска = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПроведениеЛабораторныхИсследований.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ПроведениеЛабораторныхИсследований КАК ПроведениеЛабораторныхИсследований
			|ГДЕ
			|	ПроведениеЛабораторныхИсследований.ПартияПродукции = &Партия";
		
		Запрос.УстановитьПараметр("Партия", Объект.ПартияПродукции);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда 
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
				Объект.ДокументИсследования = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПартияПродукцииПриИзменении(Элемент)
	ПартияПродукцииПриИзмененииНаСервере();
КонецПроцедуры
